{
  "projects": [
    {
      "name": "Learnify",
      "image": "/images/learnify.png",
      "description": "A multi-tenant SaaS platform offering web solutions to schools and educational institutions in Kenya. Built with Next.js and Firebase, Learnify provides features like AI-powered tools, student onboarding, parent dashboards, attendance tracking, and exam management. It aims to revolutionize curriculum delivery in Kenyan schools.",
      "technologies": ["Next.js", "Firebase", "React", "Tailwind CSS"],
      "github": "https://github.com/tevinowino/learnify",
      "liveDemo": "https://www.learnifykenya.co.ke/"
    },
    {
      "name": "ShopSmart E-commerce App",
      "image": "/images/shopsmart.png",
      "description": "A full-featured e-commerce application built using the MERN stack and Remix. It supports user authentication, product categorization, advanced search filters, cart management, secure payments, and order tracking. The app also integrates user reviews and offers responsive performance for large product catalogs.",
      "technologies": ["MongoDB", "Express.js", "React", "Node.js", "Remix", "TypeScript"],
      "github": "https://github.com/tevinowino/dash/tree/Cart-and-model-Implementation"
    },
    {
      "name": "ThoughtReflex",
      "image": "/images/thoughtreflex.png",
      "description": "An AI-powered mental wellness app that helps users process emotions, track mental health, and grow from past traumas. It features an empathetic AI companion named Mira with three modes (Therapist, Coach, Friend), journaling, reflection tools, and personalized goal suggestions to guide healing and growth.",
      "technologies": ["Next.js", "TypeScript", "Tailwind CSS", "OpenAI API"],
      "github": "https://github.com/tevinowino/To-Do-App-GMC",
      "liveDemo": "https://thoughtreflex.vercel.app"
    },
    {
      "name": "Digital Moran",
      "image": "/images/digitalmoran.png",
      "description": "A youth-focused platform built in partnership with the Digital Moran NGO to help Kenyan youths access gigs, jobs, and mentorship opportunities in tech. The app connects learners with real-world opportunities, empowering them to grow their skills and secure meaningful work.",
      "technologies": ["Next.js", "TypeScript", "Tailwind CSS", "Firebase"],
      "github": "https://github.com/tevinowino/digitalmoran"
    }
  ]
}
